<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages up Minecraft for deployment.  Minecraft's support files are installed into /Library/Application Support/minecraft, and a launchagent is installed that rsyncs into ~/Library/Application Support/minecraft on login. THIS RECIPE REQUIRES JAVA TO BE INSTALLED IN ORDER TO RUN.</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.pkg.minecraft</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Minecraft</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
	<string>com.github.nmcspadden.download.minecraft</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Comment</key>
    		<string>Uses a custom processor to decompress .lzma file</string>
    		<key>Processor</key>
    		<string>LZMADecompress</string>
    		<key>Arguments</key>
    		<dict>
    			<key>lzma_file</key>
    			<string>%RECIPE_CACHE_DIR%/downloads/launcher.pack.lzma</string>
    			<key>decompressed_path</key>
    			<string>%RECIPE_CACHE_DIR%/downloads/launcher.pack</string>
    		</dict>
        </dict>
		<dict>
        	<key>Comment</key>
        	<string>Unpacks the launcher.pack file</string>
        	<key>Processor</key>
        	<string>Unpack200</string>
        	<key>Arguments</key>
        	<dict>
        		<key>file_path</key>
        		<string>%RECIPE_CACHE_DIR%/downloads/launcher.pack</string>
        		<key>destination</key>
        		<string>%RECIPE_CACHE_DIR%/launcher.zip</string>
        	</dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root - /Lib/AppSupp/, /Applications, and /usr/local/libexec</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Minecraft</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01775</string>
                    <key>Library/Application Support/</key>
                    <string>0775</string>
                    <key>Library/Application Support/minecraft</key>
                    <string>0775</string>
                    <key>Library/LaunchAgents/</key>
                    <string>0775</string>
                    <key>usr</key>
                    <string>01775</string>
                    <key>usr/local/</key>
                    <string>0775</string>
                    <key>usr/local/libexec/</key>
                    <string>0775</string>
                    <key>Applications</key>
                    <string>01775</string>
                </dict>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Extract the contents of "launcher.zip"</string>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>archive_path</key>
        		<string>%RECIPE_CACHE_DIR%/launcher.zip</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Library/Application Support/minecraft/</string>
        	</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Get version from "minecraft.dmg"</string>
        	<key>Processor</key>
        	<string>PlistReader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>info_path</key>
        		<string>%pathname%/Minecraft.app</string>
        		<key>plist_keys</key>
        		<dict>
        			<key>CFBundleVersion</key>
        			<string>version</string>
        		</dict>
        	</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Copy the .app out of "minecraft.dmg"</string>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>%pathname%/Minecraft.app</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Applications/Minecraft.app</string>
        	</dict>
        </dict>
         <dict>
        	<key>Comment</key>
        	<string>Copy the LaunchAgent into the pkgroot</string>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>%RECIPE_DIR%/com.github.autopkg.nmcspadden-recipes.minecraft.plist</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Library/LaunchAgents/</string>
        	</dict>
        </dict>
		<dict>
        	<key>Comment</key>
        	<string>Copy the LaunchAgent script into /usr/local/libexec</string>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>%RECIPE_DIR%/VerifyMinecraft.sh</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/usr/local/libexec/</string>
        	</dict>
		</dict>
		<dict>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Finally! Build a real Apple package from Minecraft's Java installer</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>id</key>
                    <string>com.github.autopkg.nmcspadden-recipes.minecraft</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
		<dict>
        	<key>Comment</key>
        	<string>Clean up after ourselves.  Only thing left should be the .lzma and .dmg files.</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
        	<dict>
        		<key>path_list</key>
        		<array>
        			<string>%RECIPE_CACHE_DIR%/downloads/launcher.pack</string>
        			<string>%RECIPE_CACHE_DIR%/launcher.zip</string>
        			<string>%RECIPE_CACHE_DIR%/Minecraft</string>
        			<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
        		</array>
        	</dict>
		</dict>
    </array>
</dict>
</plist>
